Kelvin_Helmholtz_Instability/KelvinHelmholtzInstability_coarseMesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.1.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    location "0";
    object U;
}
dimensions [ 0 1 -1 0 0 0 0 ];
internalField uniform (0.0 0.0 0.0);
boundaryField
{
    wall
    {
        type            noSlip;
    }

    zminus
    {
        type            noSlip;
    }

    zplus
    {
        type            noSlip;
    }

}
