Kelvin_Helmholtz_Instability/KelvinHelmholtzInstability_coarseMesh/0/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.1.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object alpha.water;
}
dimensions [ 0 0 0 0 0 0 0 ];
internalField uniform 0.0;
boundaryField
{
    wall
    {
        type zeroGradient;
    }

    zminus
    {
        type zeroGradient;
    }

    zplus
    {
        type zeroGradient;
    }

}
