Kelvin_Helmholtz_Instability/KelvinHelmholtzInstability_coarseMesh/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

./Allrun.pre
./Allrun.run

#------------------------------------------------------------------------------
